;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Mon Jan 23 14:08:19 2023                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("SpiWriteRom"), DW_AT_symbol_name("_SpiWriteRom")
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$3	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$4	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$5	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
	.dwendtag DW$1


DW$6	.dwtag  DW_TAG_subprogram, DW_AT_name("SpiReadRom"), DW_AT_symbol_name("_SpiReadRom")
	.dwattr DW$6, DW_AT_declaration(0x01)
	.dwattr DW$6, DW_AT_external(0x01)
DW$7	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$8	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$9	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$10	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
	.dwendtag DW$6



        MOVW      DP,#_u16_repeat_const
        MOVZ      AR6,@_u16_repeat_const ; |272| 
        MOVL      XAR4,#FSL1            ; |272| 
        MOVL      *-SP[2],XAR4          ; |272| 
        MOV       *-SP[3],AR6           ; |272| 
        MOVL      *-SP[6],XAR1          ; |272| 
        MOVL      *-SP[8],ACC           ; |272| 
        LCR       #_TxPrintf            ; |272| 
        ; call occurs [#_TxPrintf] ; |272| 
	.dwpsn	"Rom.c",270,51
        MOVW      DP,#_u16_repeat_const
        INC       @_u16_repeat_const    ; |270| 
        MOV       AL,@_u16_repeat_const ; |270| 
        CMPB      AL,#16                ; |270| 
        BF        L1,LO                 ; |270| 
        ; branchcc occurs ; |270| 
DW$L$_maxmin_read_rom$2$E:
	.dwpsn	"Rom.c",276,1
        ADD       SP,#-264
	.dwcfa	0x1d, -8
        MOVL      XAR3,*--SP
	.dwcfa	0x1d, -6
	.dwcfa	0xc0, 11
        MOVL      XAR2,*--SP
	.dwcfa	0x1d, -4
	.dwcfa	0xc0, 9
        MOVL      XAR1,*--SP
	.dwcfa	0x1d, -2
	.dwcfa	0xc0, 7
        LRETR
        ; return occurs

DW$28	.dwtag  DW_TAG_loop
	.dwattr DW$28, DW_AT_name("H:\Tracer_Mouse\Tracer\DC\BEHEMOTH\main\Rom.asm:L1:1:1674450499")
	.dwattr DW$28, DW_AT_begin_file("Rom.c")
	.dwattr DW$28, DW_AT_begin_line(0x10e)
	.dwattr DW$28, DW_AT_end_line(0x111)
DW$29	.dwtag  DW_TAG_loop_range
	.dwattr DW$29, DW_AT_low_pc(DW$L$_maxmin_read_rom$2$B)
	.dwattr DW$29, DW_AT_high_pc(DW$L$_maxmin_read_rom$2$E)
	.dwendtag DW$28

	.dwattr DW$25, DW_AT_end_file("Rom.c")
	.dwattr DW$25, DW_AT_end_line(0x114)
	.dwattr DW$25, DW_AT_end_column(0x01)
	.dwendentry
	.dwendtag DW$25

;***************************************************************
;* FAR STRINGS                                                 *
;***************************************************************
	.sect	".econst"
	.align	2
FSL1:	.string	"[%d] MAX : %.0f , MIN : %.0f",10,0
;***************************************************************
;* UNDEFINED EXTERNAL REFERENCES                               *
;***************************************************************
	.global	_SpiWriteRom
	.global	_SpiReadRom
	.global	_TxPrintf
	.global	_u16_repeat_const
	.global	__IQ15toF
	.global	_memset
	.global	_g_sen

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************
DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr DW$T$3, DW_AT_address_class(0x16)

DW$T$24	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)
DW$30	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$31	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$32	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
	.dwendtag DW$T$24


DW$T$28	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)
DW$33	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
DW$34	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$T$28


DW$T$31	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$31, DW_AT_language(DW_LANG_C)
DW$35	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$36	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$37	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$38	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
	.dwendtag DW$T$31


DW$T$33	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$33, DW_AT_language(DW_LANG_C)
DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x01)
DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$20, DW_AT_language(DW_LANG_C)
DW$T$30	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$30, DW_AT_address_class(0x16)

DW$T$36	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$36, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$36, DW_AT_byte_size(0x100)
DW$39	.dwtag  DW_TAG_subrange_type
	.dwattr DW$39, DW_AT_upper_bound(0xff)
	.dwendtag DW$T$36

DW$T$12	.dwtag  DW_TAG_base_type, DW_AT_name("long")
	.dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$12, DW_AT_byte_size(0x02)
DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)
DW$T$16	.dwtag  DW_TAG_base_type, DW_AT_name("float")
	.dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr DW$T$16, DW_AT_byte_size(0x02)

DW$T$40	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$16)
	.dwattr DW$T$40, DW_AT_language(DW_LANG_C)
DW$40	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
	.dwendtag DW$T$40


DW$T$44	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$43)
	.dwattr DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$44, DW_AT_byte_size(0xe0)
DW$41	.dwtag  DW_TAG_subrange_type
	.dwattr DW$41, DW_AT_upper_bound(0x0f)
	.dwendtag DW$T$44

DW$T$46	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
	.dwattr DW$T$46, DW_AT_address_class(0x16)
DW$T$27	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$27, DW_AT_address_class(0x16)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x01)
DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x02)
DW$42	.dwtag  DW_TAG_far_type
	.dwattr DW$42, DW_AT_type(*DW$T$22)
DW$T$42	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$42, DW_AT_type(*DW$42)
DW$T$43	.dwtag  DW_TAG_typedef, DW_AT_name("sen_t"), DW_AT_type(*DW$T$42)
	.dwattr DW$T$43, DW_AT_language(DW_LANG_C)
DW$T$26	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$26, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$26, DW_AT_byte_size(0x01)

DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_name("sensor_variable")
	.dwattr DW$T$22, DW_AT_byte_size(0x0e)
DW$43	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$43, DW_AT_name("iq15_4095_value"), DW_AT_symbol_name("_iq15_4095_value")
	.dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
DW$44	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$44, DW_AT_name("iq15_4095_min_value"), DW_AT_symbol_name("_iq15_4095_min_value")
	.dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
DW$45	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$45, DW_AT_name("iq15_4095_max_value"), DW_AT_symbol_name("_iq15_4095_max_value")
	.dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
DW$46	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$46, DW_AT_name("iq15_127_value"), DW_AT_symbol_name("_iq15_127_value")
	.dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
DW$47	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$47, DW_AT_name("iq15_ON_OFF_value"), DW_AT_symbol_name("_iq15_ON_OFF_value")
	.dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
DW$48	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$48, DW_AT_name("u16_active_arr"), DW_AT_symbol_name("_u16_active_arr")
	.dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
DW$49	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$49, DW_AT_name("u16_passive_arr"), DW_AT_symbol_name("_u16_passive_arr")
	.dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
DW$50	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$50, DW_AT_name("iq7_weight"), DW_AT_symbol_name("_iq7_weight")
	.dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22

DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("_iq15"), DW_AT_type(*DW$T$12)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)
DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("_iq7"), DW_AT_type(*DW$T$12)
	.dwattr DW$T$21, DW_AT_language(DW_LANG_C)

	.dwattr DW$25, DW_AT_external(0x01)
	.dwattr DW$22, DW_AT_external(0x01)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

DW$CIE	.dwcie 1, 40
	.dwcfa	0x0c, 20, 0
	.dwcfa	0x07, 0
	.dwcfa	0x07, 1
	.dwcfa	0x07, 2
	.dwcfa	0x07, 3
	.dwcfa	0x07, 4
	.dwcfa	0x07, 5
	.dwcfa	0x08, 6
	.dwcfa	0x08, 7
	.dwcfa	0x08, 8
	.dwcfa	0x08, 9
	.dwcfa	0x08, 10
	.dwcfa	0x08, 11
	.dwcfa	0x07, 12
	.dwcfa	0x07, 13
	.dwcfa	0x07, 14
	.dwcfa	0x07, 15
	.dwcfa	0x07, 16
	.dwcfa	0x07, 17
	.dwcfa	0x07, 18
	.dwcfa	0x07, 19
	.dwcfa	0x07, 20
	.dwcfa	0x07, 21
	.dwcfa	0x07, 22
	.dwcfa	0x07, 23
	.dwcfa	0x07, 24
	.dwcfa	0x07, 25
	.dwcfa	0x07, 26
	.dwcfa	0x08, 27
	.dwcfa	0x07, 28
	.dwcfa	0x07, 29
	.dwcfa	0x07, 30
	.dwcfa	0x07, 31
	.dwcfa	0x07, 32
	.dwcfa	0x07, 33
	.dwcfa	0x07, 34
	.dwcfa	0x07, 35
	.dwcfa	0x07, 36
	.dwcfa	0x07, 37
	.dwcfa	0x07, 38
	.dwcfa	0x07, 39
	.dwcfa	0x07, 40

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$51	.dwtag  DW_TAG_assign_register, DW_AT_name("AL")
	.dwattr DW$51, DW_AT_location[DW_OP_reg0]
DW$52	.dwtag  DW_TAG_assign_register, DW_AT_name("AH")
	.dwattr DW$52, DW_AT_location[DW_OP_reg1]
DW$53	.dwtag  DW_TAG_assign_register, DW_AT_name("PL")
	.dwattr DW$53, DW_AT_location[DW_OP_reg2]
DW$54	.dwtag  DW_TAG_assign_register, DW_AT_name("PH")
	.dwattr DW$54, DW_AT_location[DW_OP_reg3]
DW$55	.dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
	.dwattr DW$55, DW_AT_location[DW_OP_reg4]
DW$56	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR0")
	.dwattr DW$56, DW_AT_location[DW_OP_reg5]
DW$57	.dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
	.dwattr DW$57, DW_AT_location[DW_OP_reg6]
DW$58	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR1")
	.dwattr DW$58, DW_AT_location[DW_OP_reg7]
DW$59	.dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
	.dwattr DW$59, DW_AT_location[DW_OP_reg8]
DW$60	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR2")
	.dwattr DW$60, DW_AT_location[DW_OP_reg9]
DW$61	.dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
	.dwattr DW$61, DW_AT_location[DW_OP_reg10]
DW$62	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR3")
	.dwattr DW$62, DW_AT_location[DW_OP_reg11]
DW$63	.dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
	.dwattr DW$63, DW_AT_location[DW_OP_reg12]
DW$64	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR4")
	.dwattr DW$64, DW_AT_location[DW_OP_reg13]
DW$65	.dwtag  DW_TAG_assign_register, DW_AT_name("AR5")
	.dwattr DW$65, DW_AT_location[DW_OP_reg14]
DW$66	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR5")
	.dwattr DW$66, DW_AT_location[DW_OP_reg15]
DW$67	.dwtag  DW_TAG_assign_register, DW_AT_name("AR6")
	.dwattr DW$67, DW_AT_location[DW_OP_reg16]
DW$68	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR6")
	.dwattr DW$68, DW_AT_location[DW_OP_reg17]
DW$69	.dwtag  DW_TAG_assign_register, DW_AT_name("AR7")
	.dwattr DW$69, DW_AT_location[DW_OP_reg18]
DW$70	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR7")
	.dwattr DW$70, DW_AT_location[DW_OP_reg19]
DW$71	.dwtag  DW_TAG_assign_register, DW_AT_name("SP")
	.dwattr DW$71, DW_AT_location[DW_OP_reg20]
DW$72	.dwtag  DW_TAG_assign_register, DW_AT_name("XT")
	.dwattr DW$72, DW_AT_location[DW_OP_reg21]
DW$73	.dwtag  DW_TAG_assign_register, DW_AT_name("T")
	.dwattr DW$73, DW_AT_location[DW_OP_reg22]
DW$74	.dwtag  DW_TAG_assign_register, DW_AT_name("ST0")
	.dwattr DW$74, DW_AT_location[DW_OP_reg23]
